
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.Адрес;
	ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
	
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.Обновление = Ложь;
	
	Для Каждого Строка из ОтпускаСотрудников Цикл
		
		ТочкаДиаграммы = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		ТочкаДиаграммы.Текст = Строка.Сотрудник;
		СерияДиограммы = ДиаграммаГанта.УстановитьСерию("Отпуск");
		СерияДиограммы.Текст = "Отпуск";
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(ТочкаДиаграммы, СерияДиограммы);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
				
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти