#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВКМ_ЗаплонированныеОтпуска
	Движения.ВКМ_ЗаплонированныеОтпуска.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
	|	СУММА(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДнейОтпуска) КАК ДнейОтпуска,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Перебор,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Год
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Перебор,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Год";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Перебор Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Количество отпусных дней сотрудника %1 в %2 году составляет больше 28 дней", Выборка.Сотрудник, Формат(Выборка.Год, "ДФ=yyyy;"));
			Сообщение.Сообщить();
			Отказ = Ложь;;
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ЗаплонированныеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Год = Выборка.Год;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ЗаплонированоДнейОтпуска = Выборка.ДнейОтпуска;
		
	КонецЦикла;
	
	Движения.ВКМ_ЗаплонированныеОтпуска.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли