
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()

//ВКМ Было:
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
//	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
//	|ИЗ
//	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
//	
//	Запрос.УстановитьПараметр("Период", НачалоМесяца(Объект.Дата));
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Объект.Выплаты.Очистить();
//		
//	Пока Выборка.Следующий() Цикл
//		НоваяСтрока = Объект.Выплаты.Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка); 
//	КонецЦикла;

//ВКМ Исправлено:
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
    |	ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток, 0) КАК Сумма
    |ИЗ
    |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ДатаДокумента,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
    |ГДЕ
    |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0";
    
    Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
    	ТекстСоообщения = "Нет данных для формирования зарплатной ведомости.";
    	ОбщегоНазначения.СообщитьПользователю(ТекстСоообщения);
    	Возврат;
    КонецЕсли;
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
    	ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), Выборка);
    КонецЦикла;
    

КонецПроцедуры

#КонецОбласти